{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of9", "group1-shard2of9", "group1-shard3of9", "group1-shard4of9", "group1-shard5of9", "group1-shard6of9", "group1-shard7of9", "group1-shard8of9", "group1-shard9of9"], "weights": [{"name": "dense_1/kernel", "shape": [1000, 300], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [300], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [8256, 300], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [256, 300], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [300], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_2/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_2/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_2/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_2/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 8256], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [8256], "dtype": "float32"}]}]}